Revit 2016 API
BackgroundStyle Enumeration
 Indicates the background style in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public enum BackgroundStyle
Visual Basic
Public Enumeration BackgroundStyle
Visual C++
public enum class BackgroundStyle
Members
Member name | Description
SkyNoClouds |  Sky background without clouds.
SkyVeryFewClouds |  Sky background with very few clouds.
SkyFewClouds |  Sky background with few clouds.
SkyCloudy |  Cloudy sky background.
SkyVeryCloudy |  Very cloudy sky background.
Color |  Color background.
Image |  Image background.
See Also
Autodesk.Revit.DB Namespace